cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
/*
   Copyright (c) 2024-2026. CRIDP https://github.com/cridp

   Licensed under the Apache License, Version 2.0 (the "License");
   you may not use this file except in compliance with the License.
   You may obtain a copy of the License at

           http://www.apache.org/licenses/LICENSE-2.0

   Unless required by applicable law or agreed to in writing, software
   distributed under the License is distributed on an "AS IS" BASIS,
   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
   See the License for the specific language governing permissions and
   limitations under the License.
 */

#include <esp32-hal-gpio.h>
#include <map>
#include "esp_log.h"

#include <iohcRadio.h>
#include <log_buffer.h>
#include <utility>
#include "iohcCozyDevice2W.h"

// Timestamps for precise measurements
// max airTime µs: (preamble (0x3D) + sync (3 B) + header (2 B) + payload (32 B) + CRC (2 B)) / 38.4 kbps.
volatile uint64_t timestamp_sync_started = 0;
volatile uint64_t timestamp_sync_stopped = 0;
volatile uint64_t timestamp_payload_ready = 0;
volatile uint64_t timestamp_packet_sent = 0;

TaskHandle_t IOHC::iohcRadio::txTaskHandle = nullptr;

// Structure to manage a packet in transmission
struct TxPacketWrapper {
    IOHC::iohcPacket *packet;
    uint8_t repeatsRemaining;
    uint32_t repeatTime;

    explicit TxPacketWrapper(IOHC::iohcPacket *pkt)
        : packet(pkt),
          repeatsRemaining(pkt ? pkt->repeat : 0),
          repeatTime(pkt ? pkt->repeatTime : 0)
          {}

    ~TxPacketWrapper() {
        if (packet) {
            delete packet;
            packet = nullptr;
        }
    }
};

namespace IOHC {
    iohcRadio *iohcRadio::_iohcRadio = nullptr;

    uint8_t iohcRadio::_flags[2] = {0, 0};
    volatile bool iohcRadio::f_lock_hop = false;
    volatile bool iohcRadio::send_lock = false;
    volatile bool iohcRadio::txMode = false;
    volatile iohcRadio::RadioState iohcRadio::radioState = iohcRadio::RadioState::IDLE;

    static IOHC::iohcPacket last1wPacket;

    TaskHandle_t handle_interrupt;
    struct RadioIrqEvent {
        uint8_t source;  // 0 = DIO0 (payload), 2 = DIO2 (synchro)
        uint8_t edge;    // 0 = falling, 1 = rising
        mutable uint64_t timestamp_us;
    };

    static QueueHandle_t radioIrqQueue = nullptr;
    static constexpr size_t RADIO_IRQ_QUEUE_LEN = 128;

    /**
    * No semaphore here.
    * esp_timer_get_time() is ISR-safe
    */
    void IRAM_ATTR handle_interrupt_fromDIO0(void* arg) {
        // Only GPIOS short ops, non blocking
        RadioIrqEvent ev;
        ev.source = 0; // DIO0 - PayloadReady / PacketSent
        ev.edge = gpio_get_level(static_cast<gpio_num_t>(RADIO_PACKET_AVAIL));
        ev.timestamp_us = esp_timer_get_time();

        // Send it to queue (FromISR)
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        xQueueSendFromISR(radioIrqQueue, &ev, &xHigherPriorityTaskWoken);
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
    /**
    * No semaphore here.
    * esp_timer_get_time() is ISR-safe
    */

    void IRAM_ATTR handle_interrupt_fromDIO2(void* arg) {
        // Only GPIOS short ops, non blocking
        RadioIrqEvent ev;
        ev.source = 2; // DIO2 - SyncAddress
        ev.edge = gpio_get_level(static_cast<gpio_num_t>(RADIO_SYNCHRO_DETECTED));
        ev.timestamp_us = esp_timer_get_time();

        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        xQueueSendFromISR(radioIrqQueue, &ev, &xHigherPriorityTaskWoken);
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }

    void IRAM_ATTR handleSynchroStart(iohcRadio* radio, const RadioIrqEvent &evt) {
timestamp_sync_started = evt.timestamp_us;
        radio->setRadioState(iohcRadio::RadioState::PREAMBLE);
    }

    void IRAM_ATTR handleSynchroStop(iohcRadio* radio, const RadioIrqEvent &evt) {
timestamp_sync_stopped = evt.timestamp_us;
        radio->setRadioState(iohcRadio::RadioState::RX);
        // SyncLen ~= nByte * 1250 µs
        // ets_printf("SYNCHRO LEN: %llu\n", timestamp_sync_stopped - timestamp_sync_started);
    }

    void IRAM_ATTR handlePayloadReady(iohcRadio* radio, const RadioIrqEvent &evt) {
timestamp_payload_ready = evt.timestamp_us;
        if (iohcRadio::radioState == iohcRadio::RadioState::PREAMBLE || iohcRadio::radioState == iohcRadio::RadioState::RX) {
            radio->setRadioState(iohcRadio::RadioState::PAYLOAD);
            radio->tickerCounter(radio, evt);
        }
    }

    void IRAM_ATTR handlePacketSent(iohcRadio* radio, const RadioIrqEvent &evt) {
timestamp_packet_sent = evt.timestamp_us;
        Radio::clearFlags();
        // Return the radio to RX mode
        Radio::setRx();
        radio->setRadioState(iohcRadio::RadioState::RX);
    }

    /**
    * Sequential : Read queue — no concurrencies possible.
    * tickerCounter isn't called by the ISR.
    */
    void handle_interrupt_task(void *pvParameters) {
        auto radio = static_cast<iohcRadio*>(pvParameters);
        RadioIrqEvent evt;
        // RF_IRQFLAGS1_0xDB -> MODEREADY RXREADY PLLLOCK RSSI PREAMBLEDETECT SYNCADDRESSMATCH
        // RF_IRQFLAGS2_0x26 -> FIFOLEVEL PAYLOADREADY CRCOK
        // RF_IRQFLAGS1_0xB0 -> MODEREADY TXREADY PLLLOCK
        // RF_IRQFLAGS2_0x48 -> FIFOEMPTY PACKETSENT

        while (true) {
            if (xQueueReceive(radioIrqQueue, &evt, portMAX_DELAY) == pdTRUE) {
                switch (evt.source) {
                    case 0: {
                        // DIO0 - Payload
                        // Read IRQFLAGS2 to determine the cause
                        uint8_t irqflags2 = Radio::readByte(REG_IRQFLAGS2);
                        // The order is important, DIO0 (PayloadReady) should be checked first
                        if (irqflags2 & RF_IRQFLAGS2_PAYLOADREADY) {
                            // Reception Event
                            handlePayloadReady(radio, evt);
                        } else if (irqflags2 & RF_IRQFLAGS2_PACKETSENT) {
                            // End of transmission
                            handlePacketSent(radio, evt);
                        }
                        break;
                    }

                    case 2: {
                        // DIO2 - Synchro
                        if (evt.edge == 1) { // Rising edge = Synchro detected
                            handleSynchroStart(radio, evt);
                        } else {
                            handleSynchroStop(radio, evt);
                        }
                        break;
                    }
                }
            }
        }
    }

    iohcRadio::iohcRadio() {
        Radio::initHardware();
        Radio::calibrate();

        Radio::initRegisters(MAX_FRAME_LEN);
        Radio::setCarrier(Radio::Carrier::Deviation, 19200);
        Radio::setCarrier(Radio::Carrier::Bitrate, 38400);
        Radio::setCarrier(Radio::Carrier::Bandwidth, 250);
        Radio::setCarrier(Radio::Carrier::Modulation, Radio::Modulation::FSK);

        // Configure interrupts with pull-down to avoid false triggers
         // pinMode(RADIO_DIO0_PIN, INPUT); //_PULLDOWN);
         // pinMode(RADIO_DIO2_PIN, INPUT); //_PULLDOWN);
        // Attach interrupts with hardware debounce
         // attachInterruptArg(RADIO_DIO0_PIN, handle_interrupt_fromDIO0, nullptr, RISING);
         // attachInterruptArg(RADIO_DIO2_PIN, handle_interrupt_fromDIO2, nullptr, CHANGE);
        // #define GPIO_BIT_MASK  ((1ULL<<RADIO_DIO0_PIN) | (1ULL<<RADIO_DIO1) | (1ULL<<RADIO_DIO2_PIN))
        gpio_install_isr_service(ESP_INTR_FLAG_IRAM);
        gpio_config_t io_conf = {};
        io_conf.intr_type = GPIO_INTR_POSEDGE;
        io_conf.mode = GPIO_MODE_INPUT;
        io_conf.pin_bit_mask = (1ULL<<RADIO_DIO0_PIN);
        io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
        io_conf.pull_up_en = GPIO_PULLUP_DISABLE;
        gpio_config(&io_conf);
        gpio_isr_handler_add(GPIO_NUM_26 , handle_interrupt_fromDIO0, nullptr);
        io_conf.pin_bit_mask = (1ULL<<RADIO_DIO2_PIN);
        io_conf.intr_type = GPIO_INTR_ANYEDGE;
        gpio_config(&io_conf);
        gpio_isr_handler_add(GPIO_NUM_34 , handle_interrupt_fromDIO2, nullptr);

        // Create all mutex
        tx_mutex = xSemaphoreCreateMutex(); xSemaphoreGive(tx_mutex);
        txQueue_binary_sem = xSemaphoreCreateBinary(); xSemaphoreGive(txQueue_binary_sem); // Initialement libre
        lastPacketMutex = xSemaphoreCreateMutex();

        // Create ISR Queue
        radioIrqQueue = xQueueCreate(RADIO_IRQ_QUEUE_LEN, sizeof(RadioIrqEvent));

        // Create Packet Queue
        packetQueue = xQueueCreate(PACKET_QUEUE_SIZE, sizeof(iohcPacket));

